#ifndef CD74HC166_H_
#define CD74HC166_H_

#define HC166_PORT  GPIOC

// 74HC166穿行输入
#define HC166_IN    GPIO_PIN_7

// 74HC166数据保持
#define HC166_SH    GPIO_PIN_1
// 74HC166时钟
#define HC166_CLK   GPIO_PIN_2

// 输入取反  0：禁止取反  1：使能取反
#define INPUT_REV   0


//******************************************************************************
//函数名  ：HC166_Init
//功能描述：初始化并转串芯片CD74HC166的接口
//输入    ：无
//输出    ：无
//返回值  ：无
//******************************************************************************
extern void HC166_Init(void);


//******************************************************************************
//函数名  ：HC166_Read
//功能描述：从CD74HC166读取数据
//输入    ：pdata   数据存放的地址
//          bits    读取数据的位数
//输出    ：无
//返回值  ：无
//******************************************************************************
extern void HC166_Read(u8 *pdata, u8 bits);

#endif
