#ifndef TPIC6B595_H_
#define TPIC6B595_H_

#define HC595_PORT  GPIOC

// 串行输出
#define HC595_SER   GPIO_PIN_6
// 数据移位时钟输出
#define HC595_SRCK  GPIO_PIN_5
// 寄存器输出信号
#define HC595_RCK   GPIO_PIN_4

// 输出取反  0：禁止取反  1：使能取反
#define OUTPUT_REV  0


//******************************************************************************
//函数名  ：HC595_Init
//功能描述：初始化串转并芯片TPIC6B595的接口
//输入    ：无
//输出    ：无
//返回值  ：无
//******************************************************************************
extern void HC595_Init(void);


//******************************************************************************
//函数名  ：HC595_Write
//功能描述：从TPIC6B595输出并行数据
//输入    ：pdata   数据存放的地址
//          bits    输出数据的位数
//输出    ：无
//返回值  ：无
//******************************************************************************
extern void HC595_Write(u8 *pdata, u8 bits);

#endif
